20220621/AccumulationRegisters/тм_ЗаказНаряды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>тм_ЗаказНаряды</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_АвтомобилиКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

20220621/AccumulationRegisters/тм_ЗаказНаряды/Ext/ManagerModule.bsl
Процедура ЗаписатьДвижениеДокумента(ЗаказНарядОбъект) Экспорт

	ТаблицаДляЗаписи = Неопределено;
	ЗаказНарядОбъект.ДополнительныеСвойства.Свойство("ДанныеДляЗаписиДвиженияРегистраЗаказНаряды", ТаблицаДляЗаписи);
	Если ТаблицаДляЗаписи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ДатаЗаписи = ТекущаяДатаСеанса();
	Автомобиль = ЗаказНарядОбъект.тм_Автомобиль;
	
	ЗаказНарядОбъект.Движения.тм_ЗаказНаряды.Записывать = Истина;
	ЗаказНарядОбъект.Движения.тм_ЗаказНаряды.Записать();
	ЗаказНарядОбъект.Движения.тм_ЗаказНаряды.Записывать = Истина;
	
	Для каждого СтрЗаписи Из ТаблицаДляЗаписи Цикл
		Движение = ЗаказНарядОбъект.Движения.тм_ЗаказНаряды.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,СтрЗаписи);
		Движение.Период = ДатаЗаписи;
		Движение.Автомобиль = Автомобиль;
	КонецЦикла;

КонецПроцедуры
